УТ_для_edt/src/AccumulationRegisters/ГрафикОтгрузкиТоваров/ГрафикОтгрузкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ГрафикОтгрузкиТоваров</name>
  <resources>
    <name>КоличествоИзЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНеобеспечено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоИзЗаказовГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКоличествоНеобеспеченоГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНомерСтрокиЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыКПоступлению/ТоварыКПоступлению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКПоступлению</name>
  <resources>
    <name>КОформлениюНакладныхПоРаспоряжению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюПоступленийПоРаспоряжению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюПоступленийПоНакладным</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюПоступленийПоОрдерам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлениюОрдеров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Принимается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПоступления</name>
    <type>
      <types>DefinedType.РаспоряжениеНаПоступление</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/CommonModules/смартОбщегоНазначенияСКэш/Module.bsl
//++ смарт:Подкин # 06.06.2022 12:02:34
Функция смартПредопределенныеЗначенияКэш(СсылкаПредопределенное) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |   смартПредопределенныеЗначения.Значение КАК Значение,
        |   NULL КАК К2,
        |   NULL КАК К3,
        |   NULL КАК К4
        |ИЗ
        |   Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
        |ГДЕ
        |   смартПредопределенныеЗначения.Ссылка = &Ссылка
        |   И НЕ смартПредопределенныеЗначения.СписокЗначений
        |   И НЕ смартПредопределенныеЗначения.ИспользоватьТЧСписокЗначений
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   смартПредопределенныеЗначенияЗначения.Значение,
        |   NULL,
        |   NULL,
        |   NULL
        |ИЗ
        |   Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
        |ГДЕ
        |   смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
        |   И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений
        |
        |ОБЪЕДИНИТЬ ВСЕ
        |
        |ВЫБРАТЬ
        |   смартПредопределенныеЗначенияТЧСписокЗначений.к1,
        |   смартПредопределенныеЗначенияТЧСписокЗначений.к2,
        |   смартПредопределенныеЗначенияТЧСписокЗначений.к3,
        |   смартПредопределенныеЗначенияТЧСписокЗначений.к4
        |ИЗ
        |   Справочник.смартПредопределенныеЗначения.ТЧСписокЗначений КАК смартПредопределенныеЗначенияТЧСписокЗначений
        |ГДЕ
        |   смартПредопределенныеЗначенияТЧСписокЗначений.Ссылка = &Ссылка
        |   И смартПредопределенныеЗначенияТЧСписокЗначений.Ссылка.ИспользоватьТЧСписокЗначений";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаПредопределенное);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    МассивРезультат=Новый Массив;
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        ФиксСтруктура=Новый Структура("Значение,К2,К3,К4"); 
        ФиксСтруктура.Значение=ВыборкаДетальныеЗаписи.Значение;
        ФиксСтруктура.К2=ВыборкаДетальныеЗаписи.К2;
        ФиксСтруктура.К3=ВыборкаДетальныеЗаписи.К3;
        ФиксСтруктура.К4=ВыборкаДетальныеЗаписи.К4;
        МассивРезультат.Добавить(ФиксСтруктура);    
    КонецЦикла;
    
    Возврат МассивРезультат;
    
КонецФункции//-- смарт:Подкин # 06.06.2022 12:02:34 

#Область ПланированиеЗНП
//++#1357 смарт: Балашов 18.05.2023
Функция смартЗаполнитьКолонкуПотребность(СтруктураДокумента) Экспорт
	СписокНоменклатуры = ПолучитьИзВременногоХранилища(СтруктураДокумента.Адрес);
	СкладАнализа = СтруктураДокумента.Склад;
	ДатаЗаказа = СтруктураДокумента.ДатаЗаказа;
	ЗапросДат = Новый Запрос;
	ЗапросДат.УстановитьПараметр("Дата", ДатаЗаказа);
	ЗапросДат.Текст = "ВЫБРАТЬ ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -<КОЛМЕСЯЦЕВ>) КАК НачалоАнализа";
	Если СтруктураДокумента.МесяцевАнализ <> Неопределено Тогда
		ЗапросДат.Текст = СтрЗаменить(ЗапросДат.Текст,"<КОЛМЕСЯЦЕВ>",Строка(СтруктураДокумента.МесяцевАнализ));	
	Иначе
		ЗапросДат.Текст = СтрЗаменить(ЗапросДат.Текст,"<КОЛМЕСЯЦЕВ>","3");	
	КонецЕсли;	
	
	
	Выборка = ЗапросДат.Выполнить().Выбрать();
	Выборка.Следующий();
	АнализДатаНач = НачалоДня(Выборка.НачалоАнализа);
	АнализДатаКон = КонецДня(ДатаЗаказа);
	ЗаказДатаНач = НачалоДня(ДатаЗаказа);

	ЗапросДат = Новый Запрос;
	ЗапросДат.УстановитьПараметр("Дата", ДатаЗаказа);
	ЗапросДат.Текст = "  
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ <ДЗ>
		|	ПК.Дата КАК Дата,
		|	ПК.ВидДня КАК ДеньВключенВГрафик
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ПК
		|ГДЕ
		|    ПК.Дата >= &ДатаЗаказа
		|    И ПК.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
		|";              
	Если СтруктураДокумента.ДнейЗаказа <> Неопределено Тогда
		ЗапросДат.Текст = СтрЗаменить(ЗапросДат.Текст,"<ДЗ>",Строка(СтруктураДокумента.ДнейЗаказа));	
	Иначе
		ЗапросДат.Текст = СтрЗаменить(ЗапросДат.Текст,"<ДЗ>","10");	
	КонецЕсли;	
	
	ЗапросДат.УстановитьПараметр("ДатаЗаказа",ДатаЗаказа);
	Выгрузка = ЗапросДат.Выполнить().Выгрузить();   
	ПоследняяЗапись = Выгрузка.Количество()-1;
	Выборка = Выгрузка.Получить(ПоследняяЗапись);
	ЗаказДатаКон = Выборка.Дата;
	
	Запрос = Новый Запрос;
	#Область ТекстЗапроса
	ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КалендарныеГрафики.ДатаГрафика КАК Дата,
		|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик
		|ПОМЕСТИТЬ Вт_ПериодАнализаПоДням
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|ГДЕ
		|	КалендарныеГрафики.ДатаГрафика МЕЖДУ &АнализДатаНач И &АнализДатаКон
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КалендарныеГрафики.ДатаГрафика КАК Дата,
		|	КалендарныеГрафики.ДеньВключенВГрафик КАК ДеньВключенВГрафик
		|ПОМЕСТИТЬ Вт_ПериодЗаказаПоДням
		|ИЗ
		|	РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
		|ГДЕ
		|	КалендарныеГрафики.ДатаГрафика МЕЖДУ &ЗаказДатаНач И &ЗаказДатаКон
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ПериодАнализ.РабочиеДни <> 0
		|			ТОГДА ПериодАнализ.РабочиеДни
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ДнейАнализа,
		|	ВЫБОР
		|		КОГДА ПериодЗаказ.РабочиеДни <> 0
		|			ТОГДА ПериодЗаказ.РабочиеДни
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДнейЗаказа
		|ПОМЕСТИТЬ Вт_РабочиеДниДвухПериодов
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Вт_ПериодАнализаПоДням.Дата) КАК РабочиеДни
		|	ИЗ
		|		Вт_ПериодАнализаПоДням КАК Вт_ПериодАнализаПоДням
		|	ГДЕ
		|		Вт_ПериодАнализаПоДням.ДеньВключенВГрафик) КАК ПериодАнализ,
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Вт_ПериодЗаказаПоДням.Дата) КАК РабочиеДни
		|	ИЗ
		|		Вт_ПериодЗаказаПоДням КАК Вт_ПериодЗаказаПоДням
		|	ГДЕ
		|		Вт_ПериодЗаказаПоДням.ДеньВключенВГрафик) КАК ПериодЗаказ
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГрафикДвиженияТоваров.Регистратор КАК Регистратор,
		|	ВЫБОР
		|		КОГДА ГрафикДвиженияТоваров.Регистратор.ДокументОснование <> НЕОПРЕДЕЛЕНО
		|			ТОГДА ГрафикДвиженияТоваров.Регистратор.ДокументОснование
		|		ИНАЧЕ ГрафикДвиженияТоваров.Регистратор
		|	КОНЕЦ КАК Основание,
		|	ГрафикДвиженияТоваров.Номенклатура КАК Номенклатура,
		|	ГрафикДвиженияТоваров.Характеристика КАК Характеристика,
		|	ГрафикДвиженияТоваров.Склад КАК Склад,
		|	ГрафикДвиженияТоваров.КоличествоИзЗаказов КАК КоличествоСоСклада
		|ПОМЕСТИТЬ Вт_ВсеРезервы
		|ИЗ
		|	РегистрНакопления.ГрафикОтгрузкиТоваров КАК ГрафикДвиженияТоваров
		|ГДЕ
		|	ГрафикДвиженияТоваров.КоличествоИзЗаказов > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки,
		|	ТоварыКОтгрузкеОстатки.ДокументОтгрузки.ДокументОснование,
		|	ТоварыКОтгрузкеОстатки.Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Характеристика,
		|	ТоварыКОтгрузкеОстатки.Склад,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.ВРезервеОстаток = 0
		|			ТОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.ВРезервеОстаток
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстатки
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТоварыКОтгрузкеОстатки.ВРезервеОстаток = 0
		|				ТОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
		|			ИНАЧЕ ТоварыКОтгрузкеОстатки.ВРезервеОстаток
		|		КОНЕЦ > 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Набор.Расшифровка КАК Расшифровка,
		|	Набор.Номенклатура КАК Номенклатура,
		|	Набор.Характеристика КАК Характеристика,
		|	Набор.Склад КАК Склад,
		|	Набор.Документ КАК Документ,
		|	СУММА(Набор.ВНаличииНаСкладе) КАК ВНаличииНаСкладе,
		|	СУММА(Набор.ВозвратОтКлиента) КАК ВозвратОтКлиента,
		|	СУММА(Набор.РезервОбщий) КАК РезервОбщий,
		|	СУММА(Набор.РезервОплаченный) КАК РезервОплаченный,
		|	СУММА(Набор.Отгружается) КАК Отгружается,
		|	СУММА(Набор.ВТранзитеВнутр) КАК ВТранзитеВнутр,
		|	СУММА(Набор.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|	СУММА(Набор.ВТранзитеОтПоставщика) КАК ВТранзитеОтПоставщика,
		|	СУММА(Набор.ЗаказаноНаСкладе) КАК ЗаказаноНаСкладе,
		|	СУММА(Набор.ВТранзитеСоСклада) КАК ВТранзитеСоСклада,
		|	СУММА(Набор.Предзаказано) КАК Предзаказано
		|ПОМЕСТИТЬ Вт_ВсеОстатки
		|ИЗ
		|	(ВЫБРАТЬ
		|		Т.Номенклатура КАК Номенклатура,
		|		Т.Характеристика КАК Характеристика,
		|		Т.Склад КАК Склад,
		|		NULL КАК Документ,
		|		Т.ВНаличииОстаток КАК ВНаличииНаСкладе,
		|		0 КАК ВозвратОтКлиента,
		|		0 КАК РезервОбщий,
		|		0 КАК РезервОплаченный,
		|		ВЫБОР
		|			КОГДА НЕ Т.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
		|					ИЛИ &ТекущаяДата < Т.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке
		|				ТОГДА Т.КОтгрузкеОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК Отгружается,
		|		0 КАК ЗаказаноПоставщику,
		|		0 КАК ВТранзитеОтПоставщика,
		|		0 КАК ЗаказаноНаСкладе,
		|		0 КАК ВТранзитеСоСклада,
		|		0 КАК Предзаказано,
		|		0 КАК ВТранзитеВнутр,
		|		""Остаток на складе"" КАК Расшифровка
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				Склад = &Склад
		|					И Номенклатура В (&СписокНоменклатуры)) КАК Т
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Вт_ВсеРезервы.Номенклатура,
		|		Вт_ВсеРезервы.Характеристика,
		|		Вт_ВсеРезервы.Склад,
		|		Вт_ВсеРезервы.Регистратор,
		|		0,
		|		0,
		|		Вт_ВсеРезервы.КоличествоСоСклада,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		""Резерв общий""
		|	ИЗ
		|		Вт_ВсеРезервы КАК Вт_ВсеРезервы
		|	ГДЕ
		|		Вт_ВсеРезервы.Склад = &Склад
		|		И Вт_ВсеРезервы.Номенклатура В(&СписокНоменклатуры)
		|		И Вт_ВсеРезервы.КоличествоСоСклада <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Вт_ВсеРезервы.Номенклатура,
		|		Вт_ВсеРезервы.Характеристика,
		|		Вт_ВсеРезервы.Склад,
		|		Вт_ВсеРезервы.Регистратор,
		|		0,
		|		0,
		|		0,
		|		Вт_ВсеРезервы.КоличествоСоСклада,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		""Резерв оплаченный""
		|	ИЗ
		|		Вт_ВсеРезервы КАК Вт_ВсеРезервы
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК Оплаты
		|			ПО Вт_ВсеРезервы.Регистратор = Оплаты.Заказ
		|				И (Вт_ВсеРезервы.КоличествоСоСклада > 0)
		|				И (Оплаты.ПроцентОплаты > 0)
		|	ГДЕ
		|		Вт_ВсеРезервы.Склад = &Склад
		|		И Вт_ВсеРезервы.Номенклатура В(&СписокНоменклатуры)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Т.Номенклатура,
		|		Т.Характеристика,
		|		Т.Склад,
		|		Т.ДокументОтгрузки,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ВЫБОР
		|			КОГДА Т.ДокументОтгрузки ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА Т.КОтгрузкеОстаток
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		""Отгрузка""
		|	ИЗ
		|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|				,
		|				Склад = &Склад
		|					И Номенклатура В (&СписокНоменклатуры)) КАК Т
		|	{ГДЕ
		|		Т.Характеристика.*}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыКПоступлениюОстатки.Номенклатура,
		|		ТоварыКПоступлениюОстатки.Характеристика,
		|		ТоварыКПоступлениюОстатки.Склад,
		|		ТоварыКПоступлениюОстатки.ДокументПоступления,
		|		0,
		|		ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		""К поступлению""
		|	ИЗ
		|		РегистрНакопления.ТоварыКПоступлению.Остатки(
		|				,
		|				Склад = &Склад
		|					И Номенклатура В (&СписокНоменклатуры)
		|					И ДокументПоступления ССЫЛКА Документ.ВозвратТоваровОтКлиента) КАК ТоварыКПоступлениюОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыКПоступлениюОстатки.Номенклатура,
		|		ТоварыКПоступлениюОстатки.Характеристика,
		|		ТоварыКПоступлениюОстатки.Склад,
		|		ТоварыКПоступлениюОстатки.ДокументПоступления,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		-ТоварыКПоступлениюОстатки.КОформлениюПоступленийПоОрдерамОстаток,
		|		""К поступлению внутр""
		|	ИЗ
		|		РегистрНакопления.ТоварыКПоступлению.Остатки(
		|				,
		|				Склад = &Склад
		|					И Номенклатура В (&СписокНоменклатуры)
		|					И ДокументПоступления ССЫЛКА Документ.ЗаказНаПеремещение) КАК ТоварыКПоступлениюОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикамОстатки.Номенклатура,
		|		ЗаказыПоставщикамОстатки.Характеристика,
		|		ЗаказыПоставщикамОстатки.Склад,
		|		ЗаказыПоставщикамОстатки.ЗаказПоставщику,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ЗаказыПоставщикамОстатки.ЗаказаноОстаток,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		""Заказано поставщику""
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам.Остатки(
		|				,
		|				Склад = &Склад
		|					И Номенклатура В (&СписокНоменклатуры)) КАК ЗаказыПоставщикамОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		КПоступлению.Номенклатура,
		|		КПоступлению.Характеристика,
		|		КПоступлению.Склад,
		|		КПоступлению.ДокументПоступления,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		-КПоступлению.КОформлениюПоступленийПоОрдерамОстаток,
		|		0,
		|		0,
		|		0,
		|		0,
		|		""Заказано поставщику""
		|	ИЗ
		|		РегистрНакопления.ТоварыКПоступлению.Остатки(
		|				,
		|				Склад = &Склад
		|					И Номенклатура В (&СписокНоменклатуры)
		|					И ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику) КАК КПоступлению
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Предзаказ.Номенклатура,
		|		Предзаказ.Характеристика,
		|		ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
		|		Предзаказ.ПредзаказПоставщику,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		Предзаказ.ЗаказаноОстаток,
		|		0,
		|		""Заказано поставщику""
		|	ИЗ
		|		РегистрНакопления.смартПредзаказыПоставщикам.Остатки(, Номенклатура В (&СписокНоменклатуры)) КАК Предзаказ
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыНаПеремещениеОстатки.Номенклатура,
		|		ЗаказыНаПеремещениеОстатки.Характеристика,
		|		ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение.СкладПолучатель,
		|		ЗаказыНаПеремещениеОстатки.ЗаказНаПеремещение,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ЗаказыНаПеремещениеОстатки.ЗаказаноОстаток,
		|		ЗаказыНаПеремещениеОстатки.КОформлениюОстаток,
		|		0,
		|		0,
		|		""Заказано на складе""
		|	ИЗ
		|		РегистрНакопления.ЗаказыНаПеремещение.Остатки(
		|				,
		|				ЗаказНаПеремещение.СкладПолучатель = &Склад
		|					И Номенклатура В (&СписокНоменклатуры)) КАК ЗаказыНаПеремещениеОстатки) КАК Набор
		|СГРУППИРОВАТЬ ПО
		|	Набор.Номенклатура,
		|	Набор.Характеристика,
		|	Набор.Склад,
		|	Набор.Документ,
		|	Набор.Расшифровка
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.Склад КАК Склад,
		|	МАКСИМУМ(ВложенныйЗапрос.ДнейАнализа) КАК ДнейАнализа,
		|	МАКСИМУМ(ВложенныйЗапрос.ДнейЗаказа) КАК ДнейЗаказа,
		|	СУММА(ВложенныйЗапрос.ПродажиВсего) КАК ПродажиАнализ,
		|	СУММА(ВложенныйЗапрос.ПродажиВДеньАнализа) КАК ПродажиВДеньАнализа,
		|	СУММА(ВложенныйЗапрос.ПродажиПлан) КАК ПродажиПлан,
		|	ВложенныйЗапрос.Документ КАК Документ,
		|	""Продажи"" КАК Расшифровка
		|ПОМЕСТИТЬ Вт_Продажи
		|ИЗ
		|	(ВЫБРАТЬ
		|		Продажи.Регистратор КАК Документ,
		|		Продажи.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|		Продажи.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|		Продажи.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
		|		Вт_РабочиеДниДвухПериодов.ДнейАнализа КАК ДнейАнализа,
		|		Вт_РабочиеДниДвухПериодов.ДнейЗаказа КАК ДнейЗаказа,
		|		Продажи.КоличествоОборот КАК ПродажиВсего,
		|		ВЫБОР
		|			КОГДА Вт_РабочиеДниДвухПериодов.ДнейАнализа <> 0
		|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот / Вт_РабочиеДниДвухПериодов.ДнейАнализа КАК ЧИСЛО(10, 4))
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ПродажиВДеньАнализа,
		|		ВЫБОР
		|			КОГДА Вт_РабочиеДниДвухПериодов.ДнейАнализа <> 0
		|				ТОГДА ВЫРАЗИТЬ(Продажи.КоличествоОборот * Вт_РабочиеДниДвухПериодов.ДнейЗаказа / Вт_РабочиеДниДвухПериодов.ДнейАнализа КАК ЧИСЛО(10, 4))
		|			ИНАЧЕ 0
		|		КОНЕЦ КАК ПродажиПлан
		|	ИЗ
		|		РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
		|				&АнализДатаНач,
		|				&АнализДатаКон,
		|				Авто,
		|				АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
		|					И АналитикаУчетаНоменклатуры.МестоХранения = &Склад
		|					И АналитикаУчетаНоменклатуры.Номенклатура В (&СписокНоменклатуры)) КАК Продажи,
		|		Вт_РабочиеДниДвухПериодов КАК Вт_РабочиеДниДвухПериодов) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.Характеристика,
		|	ВложенныйЗапрос.Склад,
		|	ВложенныйЗапрос.Документ
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика,
		|	Склад
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.Характеристика КАК Характеристика,
		|	ВложенныйЗапрос.ВНаличииНаСкладе КАК ВНаличииНаСкладе,
		|	ВложенныйЗапрос.ВозвратОтКлиента КАК ВозвратОтКлиента,
		|	ВложенныйЗапрос.РезервОбщий КАК РезервОбщий,
		|	ВложенныйЗапрос.РезервОплаченный КАК РезервОплаченный,
		|	ВложенныйЗапрос.Отгружается КАК Отгружается,
		|	ВложенныйЗапрос.ЗаказаноПоставщику КАК ЗаказаноПоставщику,
		|	ВложенныйЗапрос.ВТранзитеОтПоставщика КАК ВТранзитеОтПоставщика,
		|	ВложенныйЗапрос.ЗаказаноНаСкладе КАК ЗаказаноНаСкладе,
		|	ВложенныйЗапрос.ВТранзитеСоСклада КАК ВТранзитеСоСклада,
		|	ВложенныйЗапрос.ВТранзитеВнутр КАК ВТранзитеВнутр,
		|	ВложенныйЗапрос.ПродажиАнализ КАК ПродажиАнализ,
		|	ВложенныйЗапрос.ПродажиВДеньАнализа КАК ПродажиВДеньАнализа,
		|	ВЫРАЗИТЬ(ВложенныйЗапрос.ПродажиПлан КАК ЧИСЛО(15,0)) КАК ПродажиПлан,
		|	ВложенныйЗапрос.Предзаказано КАК Предзаказано,                                                                                 
       	|	ВЫРАЗИТЬ(
		|	ВЫБОР 
		|		КОГДА
		|   	(ВложенныйЗапрос.ПродажиПлан
		|		+ ВложенныйЗапрос.Отгружается 
		|		+ ВложенныйЗапрос.РезервОплаченный
		|		- ВложенныйЗапрос.ВНаличииНаСкладе
		|		- ВложенныйЗапрос.ВозвратОтКлиента
		|		- ВложенныйЗапрос.ЗаказаноПоставщику
		|		- ВложенныйЗапрос.ВТранзитеОтПоставщика
		|		- ВложенныйЗапрос.Предзаказано) > 0 
		|		ТОГДА
		|   	(ВложенныйЗапрос.ПродажиПлан
		|		+ ВложенныйЗапрос.Отгружается 
		|		+ ВложенныйЗапрос.РезервОплаченный
		|		- ВложенныйЗапрос.ВНаличииНаСкладе
		|		- ВложенныйЗапрос.ВозвратОтКлиента
		|		- ВложенныйЗапрос.ЗаказаноПоставщику
		|		- ВложенныйЗапрос.ВТранзитеОтПоставщика
		|		- ВложенныйЗапрос.Предзаказано) + 0.5
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(15,0)) КАК КЗаказу,
       	|	ВЫРАЗИТЬ(
		|	ВЫБОР 
		|		КОГДА
		|   		(ВложенныйЗапрос.ПродажиПлан - ВложенныйЗапрос.ВНаличииНаСкладе	- ВложенныйЗапрос.ЗаказаноНаСкладе) > 0
		|		ТОГДА
		|   		(ВложенныйЗапрос.ПродажиПлан - ВложенныйЗапрос.ВНаличииНаСкладе	- ВложенныйЗапрос.ЗаказаноНаСкладе) + 0.5
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(15,0)) КАК КЗаказуРегСклады
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|		ВложенныйЗапрос.Характеристика КАК Характеристика,
		|		СУММА(ВложенныйЗапрос.ВНаличииНаСкладе) КАК ВНаличииНаСкладе,
		|		СУММА(ВложенныйЗапрос.ВозвратОтКлиента) КАК ВозвратОтКлиента,
		|		СУММА(ВложенныйЗапрос.РезервОбщий) КАК РезервОбщий,
		|		СУММА(ВложенныйЗапрос.РезервОплаченный) КАК РезервОплаченный,
		|		СУММА(ВложенныйЗапрос.Отгружается) КАК Отгружается,
		|		СУММА(ВложенныйЗапрос.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|		СУММА(ВложенныйЗапрос.ВТранзитеОтПоставщика) КАК ВТранзитеОтПоставщика,
		|		СУММА(ВложенныйЗапрос.ЗаказаноНаСкладе) КАК ЗаказаноНаСкладе,
		|		СУММА(ВложенныйЗапрос.ВТранзитеСоСклада) КАК ВТранзитеСоСклада,
		|		СУММА(ВложенныйЗапрос.ВТранзитеВнутр) КАК ВТранзитеВнутр,
		|		СУММА(ВложенныйЗапрос.ПродажиАнализ) КАК ПродажиАнализ,
		|		СУММА(ВложенныйЗапрос.ПродажиВДеньАнализа) КАК ПродажиВДеньАнализа,
		|		СУММА(ВложенныйЗапрос.ПродажиПлан) КАК ПродажиПлан,
		|		СУММА(ВложенныйЗапрос.Предзаказано) КАК Предзаказано
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|			ВложенныйЗапрос.Характеристика КАК Характеристика,
		|			ВложенныйЗапрос.Склад КАК Склад,
		|			СУММА(ВложенныйЗапрос.ВНаличииНаСкладе) КАК ВНаличииНаСкладе,
		|			СУММА(ВложенныйЗапрос.ВозвратОтКлиента) КАК ВозвратОтКлиента,
		|			СУММА(ВложенныйЗапрос.РезервОбщий) КАК РезервОбщий,
		|			СУММА(ВложенныйЗапрос.РезервОплаченный) КАК РезервОплаченный,
		|			СУММА(ВложенныйЗапрос.Отгружается) КАК Отгружается,
		|			СУММА(ВложенныйЗапрос.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|			СУММА(ВложенныйЗапрос.ВТранзитеОтПоставщика) КАК ВТранзитеОтПоставщика,
		|			СУММА(ВложенныйЗапрос.ЗаказаноНаСкладе) КАК ЗаказаноНаСкладе,
		|			СУММА(ВложенныйЗапрос.ВТранзитеСоСклада) КАК ВТранзитеСоСклада,
		|			СУММА(ВложенныйЗапрос.ВТранзитеВнутр) КАК ВТранзитеВнутр,
		|			СУММА(ВложенныйЗапрос.ПродажиАнализ) КАК ПродажиАнализ,
		|			СУММА(ВложенныйЗапрос.ПродажиВДеньАнализа) КАК ПродажиВДеньАнализа,
		|			СУММА(ВложенныйЗапрос.ПродажиПлан) КАК ПродажиПлан,
		|			СУММА(ВложенныйЗапрос.Предзаказано) КАК Предзаказано
		|		ИЗ
		|			(ВЫБРАТЬ
		|				Вт_ВсеОстатки.Номенклатура КАК Номенклатура,
		|				Вт_ВсеОстатки.Характеристика КАК Характеристика,
		|				Вт_ВсеОстатки.Склад КАК Склад,
		|				Вт_ВсеОстатки.ВНаличииНаСкладе КАК ВНаличииНаСкладе,
		|				Вт_ВсеОстатки.ВозвратОтКлиента КАК ВозвратОтКлиента,
		|				Вт_ВсеОстатки.РезервОбщий КАК РезервОбщий,
		|				Вт_ВсеОстатки.РезервОплаченный КАК РезервОплаченный,
		|				Вт_ВсеОстатки.Отгружается КАК Отгружается,
		|				Вт_ВсеОстатки.ЗаказаноПоставщику КАК ЗаказаноПоставщику,
		|				Вт_ВсеОстатки.ВТранзитеОтПоставщика КАК ВТранзитеОтПоставщика,
		|				Вт_ВсеОстатки.ЗаказаноНаСкладе КАК ЗаказаноНаСкладе,
		|				Вт_ВсеОстатки.ВТранзитеСоСклада КАК ВТранзитеСоСклада,
		|				Вт_ВсеОстатки.ВТранзитеВнутр КАК ВТранзитеВнутр,
		|				0 КАК ПродажиАнализ,
		|				0 КАК ПродажиВДеньАнализа,
		|				0 КАК ПродажиПлан,
		|				Вт_ВсеОстатки.Предзаказано КАК Предзаказано
		|			ИЗ
		|				Вт_ВсеОстатки КАК Вт_ВсеОстатки
		|			
		|			ОБЪЕДИНИТЬ ВСЕ
		|			
		|			ВЫБРАТЬ
		|				Вт_Продажи.Номенклатура,
		|				Вт_Продажи.Характеристика,
		|				Вт_Продажи.Склад,
		|				0,
		|				0,
		|				0,
		|				0,
		|				0,
		|				0,
		|				0,
		|				0,
		|				0,
		|				0,
		|				Вт_Продажи.ПродажиАнализ,
		|				Вт_Продажи.ПродажиВДеньАнализа,
		|				Вт_Продажи.ПродажиПлан,
		|				0
		|			ИЗ
		|				Вт_Продажи КАК Вт_Продажи) КАК ВложенныйЗапрос
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ВложенныйЗапрос.Номенклатура,
		|			ВложенныйЗапрос.Характеристика,
		|			ВложенныйЗапрос.Склад
		|		) КАК ВложенныйЗапрос
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВложенныйЗапрос.Номенклатура,
		|		ВложенныйЗапрос.Характеристика
		|	) КАК ВложенныйЗапрос
		|";
	#КонецОбласти
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("АнализДатаНач",АнализДатаНач);
	Запрос.УстановитьПараметр("АнализДатаКон",АнализДатаКон);
	Запрос.УстановитьПараметр("ЗаказДатаНач", ЗаказДатаНач);
	Запрос.УстановитьПараметр("ЗаказДатаКон", ЗаказДатаКон);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Склад",СкладАнализа);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	Возврат Выгрузка;
КонецФункции //--#1357 смарт: Балашов 18.05.2023
#КонецОбласти 

//++ #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов  
// Возвращает период регистра "Выручка и себестоимость продаж" (ВиСП), 
// вычисленный от переданной даты закрытия заказа.
//
// Параметры:
//	ДатаЗакрытияЗаказа - Дата (без времени), начальная или конечная точка периода дат закрытия заказов;
//	Направление - Строка, определеяет какая именно часть стандартного периода была передана.
//				Варианты:
//					* НачалоПериода - вычисляется минимальный период для регистра;
//					* ОкончаниеПериода (или иное) - вычисляется максимальный период для регистра.
//
// Возвращаемое значение:
//	Дата - Период, который следует устанавливать в качестве стандартного периода для регистра ВиСП.
Функция КонвертироватьПериодЗакрытияЗаказовВПериодРегистраВиСП(Знач ДатаЗакрытияЗаказа, Знач Направление = "НачалоПериода") Экспорт

	Если Направление = "НачалоПериода" Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	НАЧАЛОПЕРИОДА(Заказы.Дата, ДЕНЬ) КАК Период
		|ИЗ
		|	Документ.ЗаказКлиента КАК Заказы	
		|ГДЕ
		|	Заказы.Проведен
		|	И НЕ Заказы.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1)
		|	И Заказы.ДатаЗакрытия >= &ДатаЗакрытияЗаказа		
		|УПОРЯДОЧИТЬ ПО
		|	Заказы.Дата ВОЗР
		|";	                     
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(МАКСИМУМ(Период), ДЕНЬ) КАК Период
		|ИЗ	
		|	РегистрНакопления.ВыручкаИСебестоимостьПродаж
		|ГДЕ
		|	НЕ смартДатаЗакрытияЗаказа = ДАТАВРЕМЯ(1, 1, 1)
		|	И смартДатаЗакрытияЗаказа <= &ДатаЗакрытияЗаказа
		|	И ТИПЗНАЧЕНИЯ(ЗаказКлиента) = ТИП(Документ.ЗаказКлиента)
		|";		
		
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаЗакрытияЗаказа", ДатаЗакрытияЗаказа);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Период, Дата(1, 1, 1));	
	
КонецФункции //-- #1544 смарт: Ермаков 17.01.2024 / Оптимизация отчетов

//++ #Б1074 смарт: Шляпников 08.10.2024 / Изменение функционала обработки Комплектация номенклатуры (ИТСМ 1525)
Функция ПолучитьАдресПользователяДляОповещенияОЗаказеНаСборку() Экспорт
	
	Возврат Справочники.смартПредопределенныеЗначения.Настройки.ПользовательДляОповещенияОЗаказеНаСборку.смартРабочаяПочта;
	
КонецФункции

//++ #Б2722 смарт: Шляпников 20.03.2025 / Заявка на разборку оборудования. Уведомления.
Функция ПолучитьЗначениеПредопределеннойНастройки(ИмяНастройки, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.смартПредопределенныеЗначения.Настройки, ИмяНастройки);
	Возврат ?(Значение = Неопределено, ЗначениеПоУмолчанию, Значение);
	
КонецФункции

//++ #Б3686 смарт: Шляпников 03.07.2025 / Проект smart-t.ru. API. Выгрузка "Личный кабинет"
Функция ПолучитьМассивУзловОбменаБитрикс() Экспорт
	Возврат смартОбменССайтомБитриксСервер.ПолучитьМассивУзловОбменаБитрикс();
КонецФункции

//++ #Б3700 смарт: Шляпников 22.07.2025 / Заявка на разборку оборудования. Дополнения. Версия 2.
Функция ПроверитьСкладРазбораНаДоступностьАвтоматическогоФормированияДокументов(Склад) Экспорт
	
	Возврат Склад.Родитель <> Справочники.смартПредопределенныеЗначения.СкладМоскваОфис.Значение.Родитель;
	
КонецФункции

//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
Функция ПолучитьСегментНоменклатурыПоИдентификатору(ИД) Экспорт
	
	Сегмент = Справочники.СегментыНоменклатуры.НайтиПоРеквизиту("смартИдентификаторДляФормул", ИД);
	
	Возврат Сегмент;
	
КонецФункции

//++ #Б4002 смарт: Шляпников 26.08.2025 / Документ Заказ клиента. Запрет проведения при несоблюдении требований платной доставки
Функция ВалютаРегламентированногоУчета() Экспорт
	
	Возврат Константы.ВалютаРегламентированногоУчета.Получить();
	
КонецФункции

// Проверяет, используется ли серийный учет для номенклатуры на указанном складе
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура для проверки
//  Склад - СправочникСсылка.Склады - склад для проверки
//  Дата - Дата - дата на которую проверяется настройка
//
// Возвращаемое значение:
//  Булево - Истина, если используется серийный учет
//
Функция ИспользуетсяСерийныйУчетДляНоменклатурыИСклада(Номенклатура, Склад) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Или НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВидНоменклатуры = Номенклатура.ВидНоменклатуры;
	
	Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыНоменклатуры.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	ВидыНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	ВидыНоменклатуры.Ссылка = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если НЕ Выборка.ИспользоватьСерии Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Выборка.ПолитикаУчетаСерий) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросПолитики = Новый Запрос;
	ЗапросПолитики.Текст =
	"ВЫБРАТЬ
	|	ПолитикиУчетаСерийНаСкладах.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий
	|ИЗ
	|	Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ПолитикиУчетаСерийНаСкладах
	|ГДЕ
	|	ПолитикиУчетаСерийНаСкладах.Склад = &Склад
	|	И ПолитикиУчетаСерийНаСкладах.Ссылка = &ВидНоменклатуры";
	
	ЗапросПолитики.УстановитьПараметр("Склад", Склад);
	ЗапросПолитики.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	
	РезультатЗапросаПолитики = ЗапросПолитики.Выполнить();
	
	Если НЕ РезультатЗапросаПолитики.Пустой() Тогда
		ВыборкаПолитики = РезультатЗапросаПолитики.Выбрать();
		ВыборкаПолитики.Следующий();
		Возврат ЗначениеЗаполнено(ВыборкаПолитики.ПолитикаУчетаСерий);
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Выборка.ПолитикаУчетаСерий);
	
КонецФункции
